package interfaces;

import models.Carrier;

/**
 * Интерфейс для взаимодействия с базой данных перевозчиков.
 * Предоставляет методы для чтения информации о перевозчиках по их идентификатору.
 */
public interface CarrierDatabaseInterface {

    /**
     * Читает и возвращает информацию о перевозчике по его уникальному идентификатору.
     *
     * @param id уникальный идентификатор перевозчика.
     * @return объект перевозчика, содержащий всю информацию о нем, или null, если перевозчик с таким ID не найден.
     */
    Carrier read(int id);
}
