package interfaces;

/**
 * Интерфейс для взаимодействия с базой банковских операций.
 * Предоставляет методы для проведения транзакций между банковскими картами.
 */
public interface PaymentTransactionInterface {

    /**
     * Проводит транзакцию между двумя банковскими картами.
     *
     * @param payment  Сумма платежа в минимальных денежных единицах (например, копейках или центах).
     * @param cardFrom Номер банковской карты отправителя.
     * @param cardTo   Номер банковской карты получателя.
     * @return true, если транзакция прошла успешно, и false в противном случае.
     */
    boolean transaction(int payment, long cardFrom, long cardTo);
}
